app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date DESC
---
  def index

    if params[:sort_by] == nil
	@movies = Movie.all